regular expression 
Text ийн загварыг гаргахад ашиглагд объект юм
Загвар нь текст дээрх загварт тохирох "хайх ба солих" функцийг хийхэд хэрэглэгддэг.


test match

i-том жижиг үсэг хамаарахгүй гээр хайх
g - бүх таарсан элементыг буцаана
[]-group
[abc] -тэмдэгтийн аль нэг нь
[A-Z] -Том A-аас том Z хүртэлх дурын тэмдэгт
[a-z] -Жижиг a-аас жижиг z хүртэлх дурын тэмдэгт
[A-z] -Том A-аас жижиг z хүртэлх дурын тэмдэгт
[0-9] -Хаалтны хоорондох дурын тэмдэгтийг олох (ямар ч цифр)
(x|y) -заагдсан 2 тэмдэгтийн аль олох
\w - бүх үсэг
\W - онцгой тэмдэгт
\d - цифр олох
\D - цифр бус тэмдэгт олох 
\s whitespace 
\S whitespace оруулахгүй
\b -Үгийн эхэнд/төгсгөлд дараах байдлаар тохирохыг ол: \bHI, ингээд төгсгө: HI\b
\B -Үгийн эхэнд болон төгсгөлд тохирохгүйг ол
\0 -NULL тэмдэгтийг ол
\n -Шинэ мөрийн тэмдэгт олох
\+ дор хаяж нэг нийцэмж байх
?!n -Араас нь тодорхой n тэмдэгт мөр байхгүй дурын тэмдэгт мөртэй таарна
is(?= n)- араас нь заагдсан тэмдэгт байна уу
^n -Matches any string with n at the beginning of it
n$ -төгсгөлд n тэмдэгт байгаа эсэх
n{X} хамгийн багдаа X- тэмдэгт
n{X,Y} х-ээс у-ийн хоорондох
n? -n-ийн тэг эсвэл нэг тохиолдлыг агуулсан дурын мөртэй таарна
n* -Matches any string that contains zero or more occurrences of n 
n+ дор хаяж нэг нийцэл